In [28]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline  
import seaborn as sns
import statsmodels.api as sm
from scipy.stats import boxcox
pd.options.display.max_rows = 100

Split the df so that no students from different country are in different

In [29]:
student_df = pd.read_csv('student_df.csv')

In [30]:
students_test = pd.read_csv('students_test.csv')

In [38]:
st_df = students_test.sort_values('country')

In [39]:
st_df

      student_id student__first_name    country  age  has_rabbit
852          853             Vicenta  Argentina   26        True
1755        1756               David  Argentina   19        True
2976        2977           Huan-Chan  Argentina   18       False
2979        2980              Miguel  Argentina   31        True
249          250                 Bob  Argentina   31        True
...          ...                 ...        ...  ...         ...
1590        1591               Julia        USA   22       False
1603        1604               Frank        USA   33       False
1614        1615            Penelope        USA   18        True
1535        1536             Charlie        USA   25       False
2499        2500            Jonathan        USA   19       False

[5000 rows x 5 columns]

In [31]:
df = student_df.sort_values('country')

In [32]:
df

     student_id student__first_name    country  age  has_rabbit
0             1               David  Argentina   24        True
579         580               Alice  Argentina   22       False
160         161               Grace  Argentina   23        True
163         164               Isaac  Argentina   21        True
944         945                Emma  Argentina   19        True
..          ...                 ...        ...  ...         ...
456         457               Julia        USA   25        True
453         454               Frank        USA   20        True
451         452                Emma        USA   18        True
485         486               David        USA   24       False
999        1000               Alice        USA   19        True

[1000 rows x 5 columns]

In [36]:
mid_point = len(df)/2
mid_point

500.0

In [37]:
df.loc[500, 'country']

'Canada'